Dlubal.RFEM5.Opening
Opening parameters

Dlubal.RFEM5.Opening.No
Number

Dlubal.RFEM5.Opening.ID
Identifier

Dlubal.RFEM5.Opening.Comment
Comment

Dlubal.RFEM5.Opening.Tag
Tag

Dlubal.RFEM5.Opening.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Opening.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.Opening.Area
Area of the opening (read only)

Dlubal.RFEM5.Opening.InSurfaceNo
Surface number in which is the opening placed

Dlubal.RFEM5.Opening.BoundaryLineCount
Count of boundary lines (read only)

Dlubal.RFEM5.Opening.BoundaryLineList
List of boundary lines